In [ ]:
#Groupby
"""
A groupby operation involves some combination of 
splitting the object, 
applying a function, 
and combining the results. 
This can be used to group large amounts of data and compute operations on these groups.
"""

# Process we do in groupby
- Splitting 
- Aggregations 
- Fiteration 
- Transformation

In [1]:
import pandas as pd

In [6]:
#dict of list
ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
#create df using above data
df = pd.DataFrame(ipl_data,index=range(1,13))
df

      Team  Rank  Year  Points
1       MI     1  2014     876
2       MI     2  2015     789
3   Devils     2  2014     863
4   Devils     3  2015     673
5    Kings     3  2014     741
6      CSK     4  2015     812
7      CSK     1  2016     756
8      CSK     1  2017     788
9       MI     2  2016     694
10  Royals     4  2014     701
11  Royals     1  2015     804
12      MI     2  2017     690

In [10]:
df['Team']

1         MI
2         MI
3     Devils
4     Devils
5      Kings
6        CSK
7        CSK
8        CSK
9         MI
10    Royals
11    Royals
12        MI
Name: Team, dtype: object

In [3]:
#i want the unique Team Names/find out total teams in dataset
# which teams are present
#df['Team'].unique()
df.Team.unique() #nominal sequence

array(['MI', 'Devils', 'Kings', 'CSK', 'Royals'], dtype=object)

In [8]:
import numpy as np
np.unique(df.Team) #ordinal sequence

array(['CSK', 'Devils', 'Kings', 'MI', 'Royals'], dtype=object)

In [11]:
# How many total teams we have???
df.Team.nunique()

5

In [12]:
#find out the total count (teamwise)
df.Team.value_counts()

MI        4
CSK       3
Devils    2
Royals    2
Kings     1
Name: Team, dtype: int64

In [10]:
#Group DataFrame using a mapper or by a Series of columns.
#groupby on Team column
# df.groupby(columnName)
df.groupby('Team')

In [14]:
a= list(df.groupby('Team'))

In [27]:
a

[('CSK',
    Team  Rank  Year  Points
  6  CSK     4  2015     812
  7  CSK     1  2016     756
  8  CSK     1  2017     788),
 ('Devils',
       Team  Rank  Year  Points
  3  Devils     2  2014     863
  4  Devils     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  5  Kings     3  2014     741),
 ('MI',
     Team  Rank  Year  Points
  1    MI     1  2014     876
  2    MI     2  2015     789
  9    MI     2  2016     694
  12   MI     2  2017     690),
 ('Royals',
        Team  Rank  Year  Points
  10  Royals     4  2014     701
  11  Royals     1  2015     804)]

In [32]:
a[2][1]

    Team  Rank  Year  Points
5  Kings     3  2014     741

In [20]:
print(type(a[0][1]))

<class 'pandas.core.frame.DataFrame'>

In [25]:
#use for loop
for i in list(df.groupby('Team')):
    print(i)

('CSK',   Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788)
('Devils',      Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673)
('Kings',     Team  Rank  Year  Points
4  Kings     3  2014     741)
('MI',    Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690)
('Royals',       Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804)

In [34]:
for team in list(df.groupby('Team')):
    print(team)

('CSK',   Team  Rank  Year  Points
6  CSK     4  2015     812
7  CSK     1  2016     756
8  CSK     1  2017     788)
('Devils',      Team  Rank  Year  Points
3  Devils     2  2014     863
4  Devils     3  2015     673)
('Kings',     Team  Rank  Year  Points
5  Kings     3  2014     741)
('MI',    Team  Rank  Year  Points
1    MI     1  2014     876
2    MI     2  2015     789
9    MI     2  2016     694
12   MI     2  2017     690)
('Royals',       Team  Rank  Year  Points
10  Royals     4  2014     701
11  Royals     1  2015     804)

In [37]:
#perform unpacking
for t,d in list(df.groupby('Team')):
    print(d)

  Team  Rank  Year  Points
6  CSK     4  2015     812
7  CSK     1  2016     756
8  CSK     1  2017     788
     Team  Rank  Year  Points
3  Devils     2  2014     863
4  Devils     3  2015     673
    Team  Rank  Year  Points
5  Kings     3  2014     741
   Team  Rank  Year  Points
1    MI     1  2014     876
2    MI     2  2015     789
9    MI     2  2016     694
12   MI     2  2017     690
      Team  Rank  Year  Points
10  Royals     4  2014     701
11  Royals     1  2015     804

In [38]:
#if i want only team from a tuple
for team,data in list(df.groupby('Team')):
    print(team)

CSK
Devils
Kings
MI
Royals

In [22]:
#if i want only dataFrame of team from a tuple
for team,data in list(df.groupby('Team')):
    #print(type(data))
    print(data)

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
    Team  Rank  Year  Points
4  Kings     3  2014     741
   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [23]:
list(df.groupby('Year'))

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [31]:
#fetch data of only MI:

for i in list(df.groupby('Team')):
    #print(i[0])
    if i[0] == 'MI':
        print(i[1])

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [36]:
for i in list(df.groupby('Team')):
    # i contains (team, team_record), apply indexing to fetch accordingly
    print(i[0])
    print()

CSK

Devils

Kings

MI

Royals

In [42]:
df[df.Team == 'CSK']

  Team  Rank  Year  Points
6  CSK     4  2015     812
7  CSK     1  2016     756
8  CSK     1  2017     788

In [39]:
# without groupby normal solutions:fetch data of only MI
df[df.Team == 'MI']

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [44]:
df.query('Team=="MI"')

   Team  Rank  Year  Points
1    MI     1  2014     876
2    MI     2  2015     789
9    MI     2  2016     694
12   MI     2  2017     690

In [42]:
#to get same answer use query
# put expression inside a query
df.query('Team=="MI"')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [45]:
#using get_group access CSK records
# df.groupby('Column_name').get_group('Category_name')
df.groupby('Team').get_group('MI')

   Team  Rank  Year  Points
1    MI     1  2014     876
2    MI     2  2015     789
9    MI     2  2016     694
12   MI     2  2017     690

In [53]:
df.groupby('Team').get_group('CSK').sort_values('Points')

  Team  Rank  Year  Points
7  CSK     1  2016     756
8  CSK     1  2017     788
6  CSK     4  2015     812

In [47]:
# In above solution i want to sort data rankwise
df.groupby('Team').get_group('CSK').sort_values('Rank')

  Team  Rank  Year  Points
7  CSK     1  2016     756
8  CSK     1  2017     788
6  CSK     4  2015     812

In [54]:
df

      Team  Rank  Year  Points
1       MI     1  2014     876
2       MI     2  2015     789
3   Devils     2  2014     863
4   Devils     3  2015     673
5    Kings     3  2014     741
6      CSK     4  2015     812
7      CSK     1  2016     756
8      CSK     1  2017     788
9       MI     2  2016     694
10  Royals     4  2014     701
11  Royals     1  2015     804
12      MI     2  2017     690

In [55]:
# groups
df.groupby('Team').groups
#it gives team name : index(where it is present)

{'CSK': [6, 7, 8], 'Devils': [3, 4], 'Kings': [5], 'MI': [1, 2, 9, 12], 'Royals': [10, 11]}

In [61]:
#take yearwise mean of points
#list(df.groupby('Year'))
df.groupby('Year').get_group(2017).Points.min()

690

In [62]:
df

      Team  Rank  Year  Points
1       MI     1  2014     876
2       MI     2  2015     789
3   Devils     2  2014     863
4   Devils     3  2015     673
5    Kings     3  2014     741
6      CSK     4  2015     812
7      CSK     1  2016     756
8      CSK     1  2017     788
9       MI     2  2016     694
10  Royals     4  2014     701
11  Royals     1  2015     804
12      MI     2  2017     690

In [65]:
#exact solution
#df.groupby('Year')['Points'].mean()
#list(df.groupby('Year')['Points'].mean())
df.groupby('Year')['Points'].mean()

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [66]:
df.groupby('Year').mean()

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [77]:
print(type(df.groupby('Year').mean()['Points']))

<class 'pandas.core.series.Series'>

In [69]:
f.ndim

1

In [74]:
z = df.groupby('Year').mean()[['Points']]
z

      Points
Year
2014  795.25
2015  769.50
2016  725.00
2017  739.00

In [75]:
print(type(z))

<class 'pandas.core.frame.DataFrame'>

In [72]:
#take sum of all points yearwise
#df.groupby('Year').sum()['Points']
df.groupby('Year').sum().Points

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [83]:
#fetch only teams with rank 1
df.groupby('Rank').get_group(2)

      Team  Rank  Year  Points
2       MI     2  2015     789
3   Devils     2  2014     863
9       MI     2  2016     694
12      MI     2  2017     690

In [81]:
#fetch 1st entry of each category(rank) according to Team with Rank groupby
#list(df.groupby('Rank'))
#df.groupby('Rank').first()
#last()
df.groupby('Rank').last()

        Team  Year  Points
Rank
1     Royals  2015     804
2         MI  2017     690
3      Kings  2014     741
4     Royals  2014     701

In [96]:
# Rankwise point average
df.groupby('Rank').mean()

        Year  Points
Rank
1     2015.5   806.0
2     2015.5   759.0
3     2014.5   707.0
4     2014.5   756.5

In [90]:
df.groupby('Rank').Points.mean()

Rank
1    806.0
2    759.0
3    707.0
4    756.5
Name: Points, dtype: float64

In [89]:
s = list(df.groupby(['Team','Year']))
s[0][0]

('CSK', 2015)

In [100]:
#Multiple column groupby
df.groupby(['Team','Year']).mean()['Points']

Team    Year
CSK     2015    812.0
        2016    756.0
        2017    788.0
Devils  2014    863.0
        2015    673.0
Kings   2014    741.0
MI      2014    876.0
        2015    789.0
        2016    694.0
        2017    690.0
Royals  2014    701.0
        2015    804.0
Name: Points, dtype: float64

In [102]:
list(df.groupby(['Team','Rank']))

[(('CSK', 1),
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 (('CSK', 4),
    Team  Rank  Year  Points
  5  CSK     4  2015     812),
 (('Devils', 2),
       Team  Rank  Year  Points
  2  Devils     2  2014     863),
 (('Devils', 3),
       Team  Rank  Year  Points
  3  Devils     3  2015     673),
 (('Kings', 3),
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 (('MI', 1),
    Team  Rank  Year  Points
  0   MI     1  2014     876),
 (('MI', 2),
     Team  Rank  Year  Points
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 (('Royals', 1),
        Team  Rank  Year  Points
  10  Royals     1  2015     804),
 (('Royals', 4),
       Team  Rank  Year  Points
  9  Royals     4  2014     701)]